#
# ▒█▀▀▀ █░░ █▀▀█ █▀▀█ ░▀░ █▀▀█ █▀▀▄ 　 ▒█▀▀▀█ █▀▀ █░░█ █░░█ ▀▀█▀▀ ▀▀█▀▀ █░█ █▀▀█ █░░░█ █▀▀ █░█ ░▀░ 
# ▒█▀▀▀ █░░ █░░█ █▄▄▀ ▀█▀ █▄▄█ █░░█ 　 ░▀▀▀▄▄ █░░ █▀▀█ █░░█ ░░█░░ ░░█░░ █▀▄ █░░█ █▄█▄█ ▀▀█ █▀▄ ▀█▀ 
# ▒█░░░ ▀▀▀ ▀▀▀▀ ▀░▀▀ ▀▀▀ ▀░░▀ ▀░░▀ 　 ▒█▄▄▄█ ▀▀▀ ▀░░▀ ░▀▀▀ ░░▀░░ ░░▀░░ ▀░▀ ▀▀▀▀ ░▀░▀░ ▀▀▀ ▀░▀ ▀▀▀
#
#                          Copyright 2023 Florian Schuttkowski, Licensed GPL3
#                    For additional information, visit https://github.com/flowinho
#
# ======================%%========================%%==========================%%=====================

# Confiuration Options for Homebrew
cask_args appdir: '~/Applications', require_sha: true

## CLI Tools

brew 'git'                      # Many OS bring outdated versions of git with them.
brew 'vim'                      # Many OS bring outdated version of vim with them.
brew 'exa'                      # Better ls
brew 'btop'                     # Best resource usage monitor.
brew 'fzf'                      # Fuzzy find.
brew 'gh'                       # Official GitHub Commandline integration.
brew 'gnupg'                    # Many OS bring outdated versions of gnugpg with them.
brew 'magic-wormhole'           # Fast peer-to-peer file transfer.
brew 'midnight-commander'       # Powerful cli-based file-manager.
brew 'ncdu'                     # Disk space analyzer.  
brew 'p7zip'                    # 7Zip implementation
brew 'pandoc'                   # Markdown to any document.
brew 'rmlint'                   # Search for duplicate files and remove them.
brew 'starship'                 # Great addition to any terminal.
brew 'tmux'                     # Defacto standard terminal multiplexer.
brew 'tree'                     # List directories and their subdirectories as trees.
brew 'wget'                     # Download files.
brew 'gping'                    # Like ping, but better.

## Casks

cask 'iterm2'                   # Nice terminal emulator.
cask 'visual-studio-code'       # Code editor.
cask 'firefox'                  # Browser
cask 'brave'                    # Browser
cask 'font-fira-code'           # Font with ligatures
cask 'font-hack'                #
cask 'font-inconsolata'         #
cask 'font-meslo-lg-nerd-font'  # Good font for zsh-theme powerline10k
cask 'appcleaner'               # Clean uninstall of macos apps.
cask 'fluid'                    # Turn websites into apps
cask 'keepassxc'                # Password manager
cask 'mactex'                   # LaTeX
cask 'xcodes'                   # Xcode version manager and updater
