tap "dracula/install"
tap "homebrew/bundle"
tap "majd/repo"
brew "atuin"
brew "bat"
brew "btop"
brew "duf"
brew "dust"
brew "eza"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "gping"
brew "jq"
brew "magic-wormhole"
brew "mas"
brew "midnight-commander"
brew "ncdu"
brew "neovim"
brew "node"
brew "p7zip"
brew "pandoc"
brew "pigz"
brew "python@3.11"
brew "rbenv"
brew "rclone"
brew "ripgrep"
brew "rmlint"
brew "scc"
brew "starship"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "yt-dlp"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "appcleaner", args: { appdir: "~/Applications" }
cask "firefox"
cask "google-chrome"
cask "ipatool"
cask "iterm2"
cask "keepassxc"
cask "kitty"
cask "macfuse"
cask "mactex"
cask "obsidian"
cask "visual-studio-code"
cask "xcodes"
mas "EasyRes", id: 688211836
vscode "bierner.markdown-mermaid"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "ms-ceintl.vscode-language-pack-de"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-repositories"
vscode "tomoki1207.pdf"
vscode "yzhang.markdown-all-in-one"
