tap "dracula/install"
tap "homebrew/bundle"
brew "btop"
brew "duf"
brew "exa"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "gping"
brew "magic-wormhole"
brew "mas"
brew "midnight-commander"
brew "ncdu"
brew "neovim"
brew "p7zip"
brew "pandoc"
brew "pigz"
brew "python@3.11"
brew "rbenv"
brew "rclone"
brew "rmlint"
brew "scc"
brew "starship"
brew "tmux"
brew "transmission-cli"
brew "tree"
brew "vim"
brew "wget"
brew "yt-dlp"
cask "appcleaner", args: { appdir: "~/Applications" }
cask "firefox"
cask "fluid", args: { appdir: "~/Applications" }
cask "iterm2"
cask "keepassxc"
cask "macfuse"
cask "mactex"
cask "obsidian"
cask "visual-studio-code"
cask "xcodes"
vscode "bierner.markdown-mermaid"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "MS-CEINTL.vscode-language-pack-de"
vscode "tomoki1207.pdf"
vscode "yzhang.markdown-all-in-one"
