tap "homebrew/bundle"
brew "automake"
brew "openssl@3"
brew "bat"
brew "bison"
brew "btop"
brew "readline"
brew "chruby"
brew "diff-so-fancy"
brew "eza"
brew "ffmpeg"
brew "fzf"
brew "forgit"
brew "gdbm"
brew "gh"
brew "git"
brew "gnupg"
brew "go"
brew "libffi"
brew "libyaml"
brew "magic-wormhole"
brew "midnight-commander"
brew "mpv"
brew "ncdu"
brew "neovim"
brew "p7zip"
brew "pandoc"
brew "pigz"
brew "pipx"
brew "python@3.11"
brew "rmlint"
brew "ruby-install"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "appcleaner"
cask "drawio"
cask "firefox"
cask "google-chrome"
cask "keepassxc"
cask "kitty"
cask "macfuse"
cask "mactex"
cask "obsidian"
cask "visual-studio-code"
cask "xcodes"
vscode "bierner.markdown-mermaid"
vscode "davidanson.vscode-markdownlint"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "github.codespaces"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "ms-ceintl.vscode-language-pack-de"
vscode "yzhang.markdown-all-in-one"
